Bwooce/ardupilot/libraries/AP_HAL_ESP32/UARTDriver.cpp
/*
 * This file is free software: you can redistribute it and/or modify it
 * under the terms of the GNU General Public License as published by the
 * Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * This file is distributed in the hope that it will be useful, but
 * WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
 * See the GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License along
 * with this program.  If not, see <http://www.gnu.org/licenses/>.
 */

#include <AP_HAL_ESP32/UARTDriver.h>
#include "ESP32_Debug.h"
#include <AP_Math/AP_Math.h>
#include <AP_SerialManager/AP_SerialManager.h>

#include "esp_log.h"
#include "driver/usb_serial_jtag.h"
#include "hal/usb_serial_jtag_ll.h"
#include "freertos/FreeRTOS.h"
#include "freertos/queue.h"
#include "freertos/task.h"
#include <inttypes.h>

#define HAL_ESP32_UART_MIN_TX_SIZE 1024  // Increased for packet atomicity
#define HAL_ESP32_UART_MIN_RX_SIZE 512

extern const AP_HAL::HAL& hal;

// Global tracking for UART1 access
static volatile uint32_t uart1_access_count = 0;
#define TRACK_UART1_ACCESS() do { \
    if (uart_num == 1) { \
        uint32_t count = __sync_fetch_and_add(&uart1_access_count, 1); \
        ESP_LOGD("UART_ACCESS", "UART1 hardware access #%" PRIu32 " from instance %p", count + 1, this); \
    } \
} while(0)

namespace ESP32
{

UARTDriver::UARTDriver(uint8_t serial_num)
    : AP_HAL::UARTDriver()
    , _write_mutex(serial_num == 1 ? false : true)  // SERIAL1 (MAVLink) uses non-recursive mutex
    , _read_mutex(serial_num == 1 ? false : true)   // SERIAL1 (MAVLink) uses non-recursive mutex
{
    _initialized = false;
    uart_num = serial_num;
    
    // Log construction with intended use
    const char* use_desc = "Unknown";
    if (serial_num == 0) use_desc = "Console/SERIAL0";
    else if (serial_num == 1) use_desc = "MAVLink/SERIAL1";
    else if (serial_num == 2) use_desc = "Telem/SERIAL2";
    
    ESP_LOGD("UART_CONSTRUCT", "UARTDriver UART%d (%s) instance %p constructed - write_mutex %p, read_mutex %p", 
             uart_num, use_desc, this, &_write_mutex, &_read_mutex);
}

// Simple GPIO pin mapping for UARTs (from hwdef)
struct UARTDesc {
    gpio_num_t rx;
    gpio_num_t tx;
};

static const UARTDesc uart_pins[] = {HAL_ESP32_UART_DEVICES};

void UARTDriver::vprintf(const char *fmt, va_list ap)
{
    // Use standard ArduPilot vprintf implementation for all UARTs
    // ESP-IDF logging is now handled separately at the system level
    AP_HAL::UARTDriver::vprintf(fmt, ap);
}

void UARTDriver::_begin(uint32_t b, uint16_t rxS, uint16_t txS)
{
    
    if (b == 0 && txS == 0 && rxS == 0 && _initialized) {
        // the thread owning this port has changed
        _uart_owner_thd = xTaskGetCurrentTaskHandle();
        return;
    }

    // Direct mapping: SERIAL0->UART0, SERIAL1->UART1, etc.
    uart_port_t p = (uart_port_t)uart_num;
    
    // Log UARTDriver instance details for debugging mutex issues
    const char* use_desc = "Unknown";
    if (uart_num == 0) use_desc = "Console/SERIAL0";
    else if (uart_num == 1) use_desc = "MAVLink/SERIAL1";
    else if (uart_num == 2) use_desc = "Telem/SERIAL2";
    
    ESP_LOGD("UART_INIT", "UARTDriver::_begin UART%d (%s) instance %p - write_mutex addr %p, read_mutex addr %p", 
             uart_num, use_desc, this, &_write_mutex, &_read_mutex);
    
    if (!_initialized) {
        // Calculate optimal buffer sizes based on baud rate
        calculate_buffer_sizes(b, rxS, txS);
        
        // Update instance buffer sizes
        RX_BUF_SIZE = rxS;
        TX_BUF_SIZE = txS;
        
        // Debug via logging system - safe from serial contamination
        
        if (p == 0) {
            // Initialize USB-Serial/JTAG driver for port 0 (ESP32-S3)
            _uart_event_queue = nullptr;  // USB doesn't use event queue
            usb_serial_jtag_driver_config_t usb_config = USB_SERIAL_JTAG_DRIVER_CONFIG_DEFAULT();
            usb_config.rx_buffer_size = RX_BUF_SIZE;
            usb_config.tx_buffer_size = TX_BUF_SIZE;
            usb_serial_jtag_driver_install(&usb_config);
        } else {
            // Initialize regular UART for other ports with DMA support
            uart_config_t config = {
                .baud_rate = (int)b,
                .data_bits = UART_DATA_8_BITS,
                .parity = UART_PARITY_DISABLE,
                .stop_bits = UART_STOP_BITS_1,
                .flow_ctrl = UART_HW_FLOWCTRL_DISABLE,
                .rx_flow_ctrl_thresh = 120,
                .source_clk = UART_SCLK_APB,
            };
            uart_param_config(p, &config);
            uart_set_pin(p,
                         uart_pins[uart_num].tx,
                         uart_pins[uart_num].rx,
                         UART_PIN_NO_CHANGE, UART_PIN_NO_CHANGE);
            
            // Install UART driver with large buffers and DMA support
            // Use event queue for interrupt-driven processing
            uart_driver_install(p, rxS, txS, 100, &_uart_event_queue, ESP_INTR_FLAG_IRAM);
        }
        _readbuf.set_size(RX_BUF_SIZE);
        
        // Protect writebuf resize with write mutex to prevent corruption during transmission
        _write_mutex.take_blocking();
        _writebuf.set_size(TX_BUF_SIZE);
        _write_mutex.give();
        _uart_owner_thd = xTaskGetCurrentTaskHandle();
        
        // Enable multithread access for protocol processing
        _allow_multithread_access = true;

        _initialized = true;
    } else {
        if (p != 0) {
            // Only set baudrate for regular UARTs, not USB-Serial/JTAG
            flush();
            uart_set_baudrate(p, b);
        }
    }
    _baudrate = b;
}

void UARTDriver::_end()
{
    if (_initialized) {
        uart_port_t p = (uart_port_t)uart_num;
        if (p == 0) {
            // Uninstall USB-Serial/JTAG driver for port 0
            usb_serial_jtag_driver_uninstall();
        } else {
            // Uninstall regular UART driver for other ports
            uart_driver_delete(p);
        }
        _readbuf.set_size(0);
        
        // Protect writebuf resize with write mutex to prevent corruption during transmission
        _write_mutex.take_blocking();
        _writebuf.set_size(0);
        _write_mutex.give();
    }
    _initialized = false;
}

void UARTDriver::_flush()
{
    uart_port_t p = (uart_port_t)uart_num;
    if (p == 0) {
        // Flush USB-Serial/JTAG interface
        // Note: usb_serial_jtag driver auto-flushes, but we ensure it here
        usb_serial_jtag_ll_txfifo_flush();
    } else {
        // Flush regular UART
        uart_flush(p);
    }
}

bool UARTDriver::is_initialized()
{
    return _initialized;
}

bool UARTDriver::tx_pending()
{
    return (_writebuf.available() > 0);
}


uint32_t UARTDriver::_available()
{
    if (!_initialized) {
        return 0;
    }
    
    // Allow access from multiple threads for protocol processing
    
    // Thread-safe buffer access - simple blocking
    _read_mutex.take_blocking();
    uint32_t result = _readbuf.available();
    _read_mutex.give();
    return result;
}

uint32_t UARTDriver::txspace()
{
    if (!_initialized) {
        return 0;
    }
    int result = _writebuf.space();
    result -= TX_BUF_SIZE / 4;
    return MAX(result, 0);

}

ssize_t IRAM_ATTR UARTDriver::_read(uint8_t *buffer, uint16_t count)
{
    if (!_initialized) {
        return -1;
    }
    
    // Thread-safe buffer read
    _read_mutex.take_blocking();
    
    uint32_t available = _readbuf.available();
    if (available == 0) {
        _read_mutex.give();
        return 0;
    }
    
    // Simple atomic read operation
    uint32_t ret = _readbuf.read(buffer, MIN(count, available));
    
    _read_mutex.give();
    
    if (ret > 0) {
        _receive_timestamp_update();
    }
    return ret;
}

void IRAM_ATTR UARTDriver::_timer_tick(void)
{
    if (!_initialized) {
        return;
    }
    
    // Debug _timer_tick calls occasionally
    static uint32_t tick_count = 0;
    if ((tick_count++ % 100) == 0) {
        TaskHandle_t current_task = xTaskGetCurrentTaskHandle();
        const char* task_name = pcTaskGetName(current_task);
        ESP_LOGD("UART_TICK", "_timer_tick: UART%d instance %p called by thread %s (%p) - tick #%" PRIu32, 
                 uart_num, this, task_name, current_task, tick_count);
    }
    
    read_data();
    write_data();
}

void IRAM_ATTR UARTDriver::read_data()
{
    uart_port_t p = (uart_port_t)uart_num;
    
    // Critical section: protect buffer writes from race conditions
    _read_mutex.take_blocking();
    
    if (p == 0) {
        // USB-Serial/JTAG interface uses polling (no events)
        int count = usb_serial_jtag_read_bytes(_buffer, sizeof(_buffer), 0);
        if (count > 0) {
            _readbuf.write(_buffer, count);
            _receive_timestamp_update();
        }
    } else {
        // Use event-driven processing for regular UARTs
        if (_uart_event_queue == nullptr) {
            return;  // No event queue configured
        }
        
        uart_event_t event;
        
        // Process events one at a time to avoid race conditions
        // Only process one event per call to prevent buffer corruption
        if (xQueueReceive(_uart_event_queue, &event, 0) == pdTRUE) {
            switch (event.type) {
                case UART_DATA: {
                    // Read available data in chunks with better error handling
                    size_t available = 0;
                    uart_get_buffered_data_len(p, &available);
                    
                    if (available > 0) {
                        size_t to_read = MIN(available, sizeof(_buffer));
                        int count = uart_read_bytes(p, _buffer, to_read, 0);
                        if (count > 0) {
                            // Atomic buffer write - all or nothing
                            if (_readbuf.space() >= count) {
                                _readbuf.write(_buffer, count);
                                _receive_timestamp_update();
                            } else {
                                // Buffer full - drop this data to prevent corruption
                                uart_flush_input(p);
                            }
                        }
                    }
                    break;
                }
                case UART_BUFFER_FULL:
                    // Handle buffer overflow - emergency read
                    uart_flush_input(p);
                    break;
                    
                case UART_FIFO_OVF:
                    // FIFO overflow - clear and continue
                    uart_flush_input(p);
                    break;
                    
                case UART_FRAME_ERR:
                case UART_PARITY_ERR:
                    // Error recovery - just log and continue
                    break;
                    
                default:
                    break;
            }
        }
    }
    
    // Release mutex at end of function
    _read_mutex.give();
}

void UARTDriver::write_data()
{
    uart_port_t p = (uart_port_t)uart_num;
    int count = 0;
    
    // Debug write_data calls
    TaskHandle_t current_task = xTaskGetCurrentTaskHandle();
    const char* task_name = pcTaskGetName(current_task);
    ESP_LOGD("UART_WRITE_DATA", "write_data: UART%d instance %p Thread %s (%p) called write_data", 
             uart_num, this, task_name, current_task);
    
    // Use write_mutex to coordinate with buffer writes
    // This ensures atomic peekbytes() -> uart_tx_chars() -> advance() sequence
    _write_mutex.take_blocking();
    
    do {
        count = _writebuf.peekbytes(_buffer, sizeof(_buffer));
        if (count > 0) {
            int sent = 0;
            if (p == 0) {
                // Use USB-Serial/JTAG interface for port 0 (ESP32-S3)
                sent = usb_serial_jtag_write_bytes(_buffer, count, 0);
            } else {
                // Use regular UART for other ports
                ESP_LOGD("UART_HW", "write_data: UART%d instance %p about to call uart_tx_chars with %d bytes", 
                         uart_num, this, count);
                TRACK_UART1_ACCESS();
                sent = uart_tx_chars(p, (const char*) _buffer, count);
                ESP_LOGD("UART_HW", "write_data: UART%d instance %p uart_tx_chars returned %d", 
                         uart_num, this, sent);
            }
            _writebuf.advance(sent);
            count = sent;
        }
    } while (count > 0);
    _write_mutex.give();
    
    // Log write_data completion
    ESP_LOGD("UART_WRITE_DATA", "write_data: UART%d instance %p Thread %s completed write_data", 
             uart_num, this, pcTaskGetName(xTaskGetCurrentTaskHandle()));
}

size_t UARTDriver::_write(const uint8_t *buffer, size_t size)
{
    if (!_initialized) {
        return 0;
    }

    // Debug writes
    TaskHandle_t current_task = xTaskGetCurrentTaskHandle();
    const char* task_name = pcTaskGetName(current_task);
    ESP_LOGD("UART_WRITE", "_write: UART%d (%p) Thread %s (%p) writing %d bytes", 
             uart_num, this, task_name, current_task, size);

    // Write atomically - only write if full data fits
    _write_mutex.take_blocking();
    
    size_t written = 0;
    if (_writebuf.space() >= size) {
        written = _writebuf.write(buffer, size);
    } else {
        // Buffer full - drop entire write to maintain atomicity
        static uint32_t drop_count = 0;
        if ((++drop_count % 100) == 1) {
            ESP_LOGW("UART_DROP", "UART%d dropped write #%" PRIu32 " (size %d, space %" PRIu32 ")", 
                     uart_num, drop_count, size, _writebuf.space());
        }
    }
    
    _write_mutex.give();
    return written;
}



bool UARTDriver::_discard_input()
{
    if (_uart_owner_thd != xTaskGetCurrentTaskHandle()) {
        return false;
    }
    if (!_initialized) {
        return false;
    }

    // Simple buffer clear - no stateful packet read cleanup needed

    _readbuf.clear();

    return true;
}

// record timestamp of new incoming data
void IRAM_ATTR UARTDriver::_receive_timestamp_update(void)
{
    _receive_timestamp[_receive_timestamp_idx^1] = AP_HAL::micros64();
    _receive_timestamp_idx ^= 1;
}


/*
  return timestamp estimate in microseconds for when the start of
  a nbytes packet arrived on the uart. This should be treated as a
  time constraint, not an exact time. It is guaranteed that the
  packet did not start being received after this time, but it
  could have been in a system buffer before the returned time.
  This takes account of the baudrate of the link. For transports
  that have no baudrate (such as USB) the time estimate may be
  less accurate.
  A return value of zero means the HAL does not support this API
*/
uint64_t UARTDriver::receive_time_constraint_us(uint16_t nbytes)
{
    uint64_t last_receive_us = _receive_timestamp[_receive_timestamp_idx];
    if (_baudrate > 0) {
        // assume 10 bits per byte. For USB we assume zero transport delay
        uint32_t transport_time_us = (1000000UL * 10UL / _baudrate) * (nbytes + available());
        last_receive_us -= transport_time_us;
    }
    return last_receive_us;
}

void UARTDriver::calculate_buffer_sizes(uint32_t baudrate, uint16_t &rxS, uint16_t &txS)
{
    // Calculate minimum buffer sizes based on ChibiOS approach
    uint16_t min_tx_buffer = HAL_ESP32_UART_MIN_TX_SIZE;
    uint16_t min_rx_buffer = HAL_ESP32_UART_MIN_RX_SIZE;
    
    // Scale RX buffer with baud rate to handle burst traffic
    // Ensure we can buffer at least 100ms of data at full rate
    if (baudrate > 0) {
        // Convert baud (bits/sec) to bytes/sec, then to bytes per 100ms
        uint32_t bytes_per_100ms = (baudrate / 10) / 10; // /10 for bits->bytes, /10 for 100ms
        min_rx_buffer = MAX(min_rx_buffer, bytes_per_100ms);
    }
    
    // Double buffers for high-speed connections
    if (baudrate >= 460800) {
        min_tx_buffer *= 2;
        min_rx_buffer *= 2;
    }
    
#if CONFIG_IDF_TARGET_ESP32S3
    // ESP32-S3 has plenty of memory - use larger buffers for reliability
    min_tx_buffer *= 2;
    min_rx_buffer *= 2;
#endif
    
    // Apply calculated minimums
    if (txS < min_tx_buffer) {
        txS = min_tx_buffer;
    }
    if (rxS < min_rx_buffer) {
        rxS = min_rx_buffer;
    }
    
    // Cap at reasonable maximums
    txS = MIN(txS, 16384U);
    rxS = MIN(rxS, 16384U);
}

}
